#все нижеперечисленные команды пишутся в терминале
#git init-создает локальный репозиторий(папка,в которой отслеживаются изменения файлов)
#git status-проверяет статус файлов в репозитории
#git add <имя файла>-добавляет файл в отслеживание
#git commit -m "комментарий"-сохраняет текущую версию кода
#git log-показывает список коммитов в данной ветке
#git checkout <id коммита> -просмотр коммита
#git checkout <имя ветки> -переход на ветку
#git switch -c <имя новой ветки> -создание новой ветки при просмотре коммита и переход на эту ветку с перносом туда
# этого коммита
#git branch -показать все ветки
#git branch <имя новой ветки> -создание новой ветки
# git remote add origin https://github.com/AlexeyAP-create/Python.git - соединяет локальный репозиторий с удаленным
# git branch -M main - переименовывает главную ветку master в main
# git push -u origin main - загружает данные с локального репозитория на удаленный
