#все нижеперечисленные команды пишутся в терминале
#git init-создает локальный репозиторий(папка,в которой отслеживаются изменения файлов)
#git status-проверяет статус файлов в репозитории
#git add <имя файла>-добавляет файл в отслеживание
#git commit -m "комментарий"-сохраняет текущую версию кода
#git log-показывает список коммитов в данной ветке
#git checkout <id коммита> -просмотр коммита
#git checkout <имя ветки> -переход на ветку
#git switch -c <имя новой ветки> -создание новой ветки при просмотре коммита и переход на эту ветку с перносом туда
# этого коммита
#git branch -показать все ветки
#git branch <имя новой ветки> -создание новой ветки